{
  "char_to_num": {
    " ": 1,
    "!": 2,
    "'": 3,
    "(": 4,
    ")": 5,
    ",": 6,
    "-": 7,
    ".": 8,
    ":": 9,
    ";": 10,
    "?": 11,
    "ං": 12,
    "ඃ": 13,
    "අ": 14,
    "ආ": 15,
    "ඇ": 16,
    "ඈ": 17,
    "ඉ": 18,
    "ඊ": 19,
    "උ": 20,
    "ඌ": 21,
    "ඍ": 22,
    "එ": 23,
    "ඒ": 24,
    "ඓ": 25,
    "ඔ": 26,
    "ඕ": 27,
    "ඖ": 28,
    "ක": 29,
    "ඛ": 30,
    "ග": 31,
    "ඝ": 32,
    "ඞ": 33,
    "ඟ": 34,
    "ච": 35,
    "ඡ": 36,
    "ජ": 37,
    "ඣ": 38,
    "ඤ": 39,
    "ඥ": 40,
    "ට": 41,
    "ඨ": 42,
    "ඩ": 43,
    "ඪ": 44,
    "ණ": 45,
    "ඬ": 46,
    "ත": 47,
    "ථ": 48,
    "ද": 49,
    "ධ": 50,
    "න": 51,
    "ඳ": 52,
    "ප": 53,
    "ඵ": 54,
    "බ": 55,
    "භ": 56,
    "ම": 57,
    "ඹ": 58,
    "ය": 59,
    "ර": 60,
    "ල": 61,
    "ව": 62,
    "ශ": 63,
    "ෂ": 64,
    "ස": 65,
    "හ": 66,
    "ළ": 67,
    "ෆ": 68,
    "්": 69,
    "ා": 70,
    "ැ": 71,
    "ෑ": 72,
    "ි": 73,
    "ී": 74,
    "ු": 75,
    "ූ": 76,
    "ෘ": 77,
    "ෙ": 78,
    "ේ": 79,
    "ෛ": 80,
    "ො": 81,
    "ෝ": 82,
    "ෞ": 83,
    "ෟ": 84,
    "ෲ": 85,
    "‍": 86,
    "<BLANK>": 0
  },
  "num_to_char": {
    "1": " ",
    "2": "!",
    "3": "'",
    "4": "(",
    "5": ")",
    "6": ",",
    "7": "-",
    "8": ".",
    "9": ":",
    "10": ";",
    "11": "?",
    "12": "ං",
    "13": "ඃ",
    "14": "අ",
    "15": "ආ",
    "16": "ඇ",
    "17": "ඈ",
    "18": "ඉ",
    "19": "ඊ",
    "20": "උ",
    "21": "ඌ",
    "22": "ඍ",
    "23": "එ",
    "24": "ඒ",
    "25": "ඓ",
    "26": "ඔ",
    "27": "ඕ",
    "28": "ඖ",
    "29": "ක",
    "30": "ඛ",
    "31": "ග",
    "32": "ඝ",
    "33": "ඞ",
    "34": "ඟ",
    "35": "ච",
    "36": "ඡ",
    "37": "ජ",
    "38": "ඣ",
    "39": "ඤ",
    "40": "ඥ",
    "41": "ට",
    "42": "ඨ",
    "43": "ඩ",
    "44": "ඪ",
    "45": "ණ",
    "46": "ඬ",
    "47": "ත",
    "48": "ථ",
    "49": "ද",
    "50": "ධ",
    "51": "න",
    "52": "ඳ",
    "53": "ප",
    "54": "ඵ",
    "55": "බ",
    "56": "භ",
    "57": "ම",
    "58": "ඹ",
    "59": "ය",
    "60": "ර",
    "61": "ල",
    "62": "ව",
    "63": "ශ",
    "64": "ෂ",
    "65": "ස",
    "66": "හ",
    "67": "ළ",
    "68": "ෆ",
    "69": "්",
    "70": "ා",
    "71": "ැ",
    "72": "ෑ",
    "73": "ි",
    "74": "ී",
    "75": "ු",
    "76": "ූ",
    "77": "ෘ",
    "78": "ෙ",
    "79": "ේ",
    "80": "ෛ",
    "81": "ො",
    "82": "ෝ",
    "83": "ෞ",
    "84": "ෟ",
    "85": "ෲ",
    "86": "‍",
    "0": "<BLANK>"
  }
}